In [1]:
import pandas as pd
df=pd.read_csv("test1.csv")
df.head()

        Name  Age
0      Krish   31
1  Subhanshu   30
2      Sunny   29
3       Paul   24
4     Harsha   21

In [2]:
import pyspark

In [3]:
from pyspark.sql import SparkSession
spark=SparkSession.builder.appName("test").getOrCreate()
spark

In [4]:
df_pyspark=spark.read.csv('test1.csv')
type(df_pyspark)

pyspark.sql.dataframe.DataFrame

In [5]:
df_pyspark

DataFrame[_c0: string, _c1: string]

In [6]:
df_pyspark=spark.read.option('header','true').csv('test1.csv')
df_pyspark.show()

+---------+---+
|     Name|Age|
+---------+---+
|    Krish| 31|
|Subhanshu| 30|
|    Sunny| 29|
|     Paul| 24|
|   Harsha| 21|
|  Shubham| 23|
+---------+---+

In [7]:
df_pyspark.head(5)

[Row(Name='Krish', Age='31'),
 Row(Name='Subhanshu', Age='30'),
 Row(Name='Sunny', Age='29'),
 Row(Name='Paul', Age='24'),
 Row(Name='Harsha', Age='21')]

In [8]:
df_pyspark.printSchema()

root
 |-- Name: string (nullable = true)
 |-- Age: string (nullable = true)

## part 1

In [9]:
# read dataset
df_pyspark=spark.read.option('header','true').csv('test2.csv',inferSchema=True)
df_pyspark.show()

+---------+---+----------+
|     Name|Age|Experience|
+---------+---+----------+
|    Krish| 31|        10|
|Subhanshu| 30|         8|
|    Sunny| 29|         7|
|     Paul| 24|         6|
|   Harsha| 21|         4|
|  Shubham| 23|         5|
+---------+---+----------+

In [10]:
# display schema
df_pyspark.printSchema()

root
 |-- Name: string (nullable = true)
 |-- Age: integer (nullable = true)
 |-- Experience: integer (nullable = true)

In [11]:
type(df_pyspark)

pyspark.sql.dataframe.DataFrame

In [12]:
#column data type
df_pyspark.dtypes

[('Name', 'string'), ('Age', 'int'), ('Experience', 'int')]

In [13]:
#select a column
df_pyspark.select('Name')

DataFrame[Name: string]

In [14]:
df_pyspark.select('Name').show()

+---------+
|     Name|
+---------+
|    Krish|
|Subhanshu|
|    Sunny|
|     Paul|
|   Harsha|
|  Shubham|
+---------+

In [15]:
# select multiple columns
df_pyspark.select(['Name','Experience']).show()

+---------+----------+
|     Name|Experience|
+---------+----------+
|    Krish|        10|
|Subhanshu|         8|
|    Sunny|         7|
|     Paul|         6|
|   Harsha|         4|
|  Shubham|         5|
+---------+----------+

In [16]:
# describe function
df_pyspark.describe()

DataFrame[summary: string, Name: string, Age: string, Experience: string]

In [17]:
df_pyspark.describe().show()

+-------+------+------------------+-----------------+
|summary|  Name|               Age|       Experience|
+-------+------+------------------+-----------------+
|  count|     6|                 6|                6|
|   mean|  null|26.333333333333332|6.666666666666667|
| stddev|  null| 4.179314138308661|2.160246899469287|
|    min|Harsha|                21|                4|
|    max| Sunny|                31|               10|
+-------+------+------------------+-----------------+

In [18]:
# adding a new column
df_pyspark=df_pyspark.withColumn('Experience after two years',df_pyspark['Experience']+2)
df_pyspark.show()

+---------+---+----------+--------------------------+
|     Name|Age|Experience|Experience after two years|
+---------+---+----------+--------------------------+
|    Krish| 31|        10|                        12|
|Subhanshu| 30|         8|                        10|
|    Sunny| 29|         7|                         9|
|     Paul| 24|         6|                         8|
|   Harsha| 21|         4|                         6|
|  Shubham| 23|         5|                         7|
+---------+---+----------+--------------------------+

In [19]:
# drop a column
df_pyspark=df_pyspark.drop('Experience after two years')
df_pyspark.show()

+---------+---+----------+
|     Name|Age|Experience|
+---------+---+----------+
|    Krish| 31|        10|
|Subhanshu| 30|         8|
|    Sunny| 29|         7|
|     Paul| 24|         6|
|   Harsha| 21|         4|
|  Shubham| 23|         5|
+---------+---+----------+

In [20]:
# rename a column
df_pyspark=df_pyspark.withColumnRenamed('Name','New Name')
df_pyspark.show()

+---------+---+----------+
| New Name|Age|Experience|
+---------+---+----------+
|    Krish| 31|        10|
|Subhanshu| 30|         8|
|    Sunny| 29|         7|
|     Paul| 24|         6|
|   Harsha| 21|         4|
|  Shubham| 23|         5|
+---------+---+----------+

In [21]:
# read another dataset
df_pyspark=spark.read.csv('test3.csv',header=True,inferSchema=True)
df_pyspark.show()

+---------+----+----------+------+
|     Name| Age|Experience|Salary|
+---------+----+----------+------+
|    Krish|  31|        10| 30000|
|Subhanshu|  30|         8| 25000|
|    Sunny|  29|         7| 20000|
|     Paul|  24|         6| 20000|
|   Harsha|  21|         4| 15000|
|  Shubham|  23|         5| 18000|
|   Mahesh|null|      null| 40000|
|     null|  34|        10| 38000|
|     null|  36|      null|  null|
+---------+----+----------+------+

In [22]:
df_pyspark.na.drop().show()

+---------+---+----------+------+
|     Name|Age|Experience|Salary|
+---------+---+----------+------+
|    Krish| 31|        10| 30000|
|Subhanshu| 30|         8| 25000|
|    Sunny| 29|         7| 20000|
|     Paul| 24|         6| 20000|
|   Harsha| 21|         4| 15000|
|  Shubham| 23|         5| 18000|
+---------+---+----------+------+

In [23]:
# drop the null values
#how = any if any one column has null value then drop that column
df_pyspark.na.drop(how="any").show()

+---------+---+----------+------+
|     Name|Age|Experience|Salary|
+---------+---+----------+------+
|    Krish| 31|        10| 30000|
|Subhanshu| 30|         8| 25000|
|    Sunny| 29|         7| 20000|
|     Paul| 24|         6| 20000|
|   Harsha| 21|         4| 15000|
|  Shubham| 23|         5| 18000|
+---------+---+----------+------+

In [24]:
#how = all if full row is null then drop it
df_pyspark.na.drop(how="all").show()

+---------+----+----------+------+
|     Name| Age|Experience|Salary|
+---------+----+----------+------+
|    Krish|  31|        10| 30000|
|Subhanshu|  30|         8| 25000|
|    Sunny|  29|         7| 20000|
|     Paul|  24|         6| 20000|
|   Harsha|  21|         4| 15000|
|  Shubham|  23|         5| 18000|
|   Mahesh|null|      null| 40000|
|     null|  34|        10| 38000|
|     null|  36|      null|  null|
+---------+----+----------+------+

In [25]:
#threshold -> if thresh=3 then atleast 3 column must be contain non null value. Otherwise drop it.

df_pyspark.na.drop(how="any",thresh=2).show()

+---------+----+----------+------+
|     Name| Age|Experience|Salary|
+---------+----+----------+------+
|    Krish|  31|        10| 30000|
|Subhanshu|  30|         8| 25000|
|    Sunny|  29|         7| 20000|
|     Paul|  24|         6| 20000|
|   Harsha|  21|         4| 15000|
|  Shubham|  23|         5| 18000|
|   Mahesh|null|      null| 40000|
|     null|  34|        10| 38000|
+---------+----+----------+------+

In [26]:
# subset -> delete specific columns null value

df_pyspark.na.drop(how="any",subset='Age').show()

+---------+---+----------+------+
|     Name|Age|Experience|Salary|
+---------+---+----------+------+
|    Krish| 31|        10| 30000|
|Subhanshu| 30|         8| 25000|
|    Sunny| 29|         7| 20000|
|     Paul| 24|         6| 20000|
|   Harsha| 21|         4| 15000|
|  Shubham| 23|         5| 18000|
|     null| 34|        10| 38000|
|     null| 36|      null|  null|
+---------+---+----------+------+

In [27]:
# filling the null values
df_pyspark.na.fill('Missing values',['Name','Age']).show()

+--------------+----+----------+------+
|          Name| Age|Experience|Salary|
+--------------+----+----------+------+
|         Krish|  31|        10| 30000|
|     Subhanshu|  30|         8| 25000|
|         Sunny|  29|         7| 20000|
|          Paul|  24|         6| 20000|
|        Harsha|  21|         4| 15000|
|       Shubham|  23|         5| 18000|
|        Mahesh|null|      null| 40000|
|Missing values|  34|        10| 38000|
|Missing values|  36|      null|  null|
+--------------+----+----------+------+

In [28]:
# imputer function
from pyspark.ml.feature import Imputer
imputer=Imputer(
    inputCols=['Age','Experience','Salary'],
    outputCols=["{}_imputed".format(c) for c in ['Age','Experience','Salary']]
).setStrategy('mean')

In [29]:
imputer.fit(df_pyspark).transform(df_pyspark).show()

+---------+----+----------+------+-----------+------------------+--------------+
|     Name| Age|Experience|Salary|Age_imputed|Experience_imputed|Salary_imputed|
+---------+----+----------+------+-----------+------------------+--------------+
|    Krish|  31|        10| 30000|         31|                10|         30000|
|Subhanshu|  30|         8| 25000|         30|                 8|         25000|
|    Sunny|  29|         7| 20000|         29|                 7|         20000|
|     Paul|  24|         6| 20000|         24|                 6|         20000|
|   Harsha|  21|         4| 15000|         21|                 4|         15000|
|  Shubham|  23|         5| 18000|         23|                 5|         18000|
|   Mahesh|null|      null| 40000|         28|                 7|         40000|
|     null|  34|        10| 38000|         34|                10|         38000|
|     null|  36|      null|  null|         36|                 7|         25750|
+---------+----+----------+------+-----------+------------------+--------------+

### filter operation

In [31]:
#1:00:59
df_pyspark.show()

+---------+----+----------+------+
|     Name| Age|Experience|Salary|
+---------+----+----------+------+
|    Krish|  31|        10| 30000|
|Subhanshu|  30|         8| 25000|
|    Sunny|  29|         7| 20000|
|     Paul|  24|         6| 20000|
|   Harsha|  21|         4| 15000|
|  Shubham|  23|         5| 18000|
|   Mahesh|null|      null| 40000|
|     null|  34|        10| 38000|
|     null|  36|      null|  null|
+---------+----+----------+------+

In [42]:
df_pyspark=spark.read.csv("test4.csv",header=True,inferSchema=True)
df_pyspark.show()

+---------+---+----------+------+
|     Name|Age|Experience|Salary|
+---------+---+----------+------+
|    Krish| 31|        10| 30000|
|Subhanshu| 30|         8| 25000|
|    Sunny| 29|         7| 20000|
|     Paul| 24|         6| 20000|
|   Harsha| 21|         4| 15000|
|  Shubham| 23|         5| 18000|
+---------+---+----------+------+

In [43]:
df_pyspark.filter("Salary<=20000").show()

+-------+---+----------+------+
|   Name|Age|Experience|Salary|
+-------+---+----------+------+
|  Sunny| 29|         7| 20000|
|   Paul| 24|         6| 20000|
| Harsha| 21|         4| 15000|
|Shubham| 23|         5| 18000|
+-------+---+----------+------+

In [44]:
df_pyspark.filter(df_pyspark['Salary']<=20000).select(['Name','Age']).show()

+-------+---+
|   Name|Age|
+-------+---+
|  Sunny| 29|
|   Paul| 24|
| Harsha| 21|
|Shubham| 23|
+-------+---+

In [45]:
# multiple condition
df_pyspark.filter((df_pyspark['Salary']<=20000) & (df_pyspark['Age']<24)).show()

+-------+---+----------+------+
|   Name|Age|Experience|Salary|
+-------+---+----------+------+
| Harsha| 21|         4| 15000|
|Shubham| 23|         5| 18000|
+-------+---+----------+------+

In [46]:
# not operation
df_pyspark.filter(~((df_pyspark['Salary']<=20000) & (df_pyspark['Age']<24))).show()

+---------+---+----------+------+
|     Name|Age|Experience|Salary|
+---------+---+----------+------+
|    Krish| 31|        10| 30000|
|Subhanshu| 30|         8| 25000|
|    Sunny| 29|         7| 20000|
|     Paul| 24|         6| 20000|
+---------+---+----------+------+

In [47]:
df_pyspark.filter((df_pyspark['Salary']<=20000) | (df_pyspark['Age']<24)).show()

+-------+---+----------+------+
|   Name|Age|Experience|Salary|
+-------+---+----------+------+
|  Sunny| 29|         7| 20000|
|   Paul| 24|         6| 20000|
| Harsha| 21|         4| 15000|
|Shubham| 23|         5| 18000|
+-------+---+----------+------+

### group by and aggregiate

In [51]:
df_pyspark=spark.read.csv('test5.csv',header=True,inferSchema=True)
df_pyspark.show()

+---------+------------+------+
|     Name|  Department|Salary|
+---------+------------+------+
|    Krish|Data Science| 10000|
|    Krish|         IOT|  5000|
|   Mahesh|    Big Data|  4000|
|    Krish|    Big Data|  4000|
|   Mahesh|Data Science|  3000|
|Sudhanshu|Data Science| 20000|
|Sudhanshu|         IOT| 10000|
|Sudhanshu|    Big Data|  5000|
|    Sunny|Data Science| 10000|
|    Sunny|    Big Data|  2000|
+---------+------------+------+

In [52]:
# group by and aggregiate works together
df_pyspark.groupBy('Name')

In [53]:
# group by name and find maximum salary
df_pyspark.groupBy('Name').sum().show()

+---------+-----------+
|     Name|sum(Salary)|
+---------+-----------+
|Sudhanshu|      35000|
|    Sunny|      12000|
|    Krish|      19000|
|   Mahesh|       7000|
+---------+-----------+

In [54]:
# find out which department gives highest salary
df_pyspark.groupBy('Department').sum().show()

+------------+-----------+
|  Department|sum(Salary)|
+------------+-----------+
|         IOT|      15000|
|    Big Data|      15000|
|Data Science|      43000|
+------------+-----------+

In [55]:
# Avg salary
df_pyspark.groupBy('Department').mean().show()

+------------+-----------+
|  Department|avg(Salary)|
+------------+-----------+
|         IOT|     7500.0|
|    Big Data|     3750.0|
|Data Science|    10750.0|
+------------+-----------+

In [56]:
# count number of employees
df_pyspark.groupBy('Department').count().show()

+------------+-----+
|  Department|count|
+------------+-----+
|         IOT|    2|
|    Big Data|    4|
|Data Science|    4|
+------------+-----+

### agg

In [57]:
df_pyspark.agg({'Salary': 'sum'}).show()

+-----------+
|sum(Salary)|
+-----------+
|      73000|
+-----------+